In [28]:
import pandas as pd

In [97]:
from sqlalchemy import create_engine, func
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Float, DateTime, Date, Time
from sqlalchemy.orm import Session

In [2]:
import datetime as dt

In [17]:
# Sets an object to utilize the default declarative base in SQL Alchemy
Base = declarative_base()

In [18]:
# Creates Classes which will serve as the anchor points for our Table
class SP_Data(Base):
    __tablename__ = 'sp_data_20200320'
    id = Column(Integer, primary_key=True)
    date = Column(Date)
    open = Column(Float)
    high = Column(Float)
    low = Column(Float)
    close = Column(Float)
    adj_close = Column(Float)
    volume = Column(Integer)

In [19]:
# Create Database Connection
engine = create_engine("sqlite:///../db/bulls_bears.sqlite")
conn = engine.connect()

In [20]:
# Create a "Metadata" Layer That Abstracts our SQL Database
# ----------------------------------
# Create (if not already in existence) the tables associated with our classes.
Base.metadata.create_all(engine)

In [21]:
# Use this to clear out the db
# ----------------------------------
# Base.metadata.drop_all(engine)
# Base.metadata.clear()

In [22]:
from sqlalchemy import inspect

In [23]:
# Create the inspector and connect it to the engine
inspector = inspect(engine)

In [24]:
# Collect the names of tables within the database
inspector.get_table_names()

['sp_data']

In [25]:
# Using the inspector to print the column names within the 'tweet_data' table and its types
columns = inspector.get_columns('sp_data')
for column in columns:
    print(column["name"], column["type"])

id INTEGER
date DATE
open FLOAT
high FLOAT
low FLOAT
close FLOAT
adj_close FLOAT
volume INTEGER

In [69]:
data_file = "../datasets/SAP500.csv"

In [70]:
sp_df = pd.read_csv(data_file)

In [71]:
sp_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,1/3/2007,1418.030029,1429.420044,1407.859985,1416.599976,1416.599976,3429160000
1,1/4/2007,1416.599976,1421.839966,1408.430054,1418.339966,1418.339966,3004460000
2,1/5/2007,1418.339966,1418.339966,1405.750000,1409.709961,1409.709961,2919400000
3,1/8/2007,1409.260010,1414.979980,1403.969971,1412.839966,1412.839966,2763340000
4,1/9/2007,1412.839966,1415.609985,1405.420044,1412.109985,1412.109985,3038380000

In [72]:
sp_df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [73]:
sp_df["Date"] = sp_df["Date"].apply(lambda x: dt.datetime.strptime(x, "%m/%d/%Y").date())

In [80]:
sp_df = sp_df.rename(columns={"Date": "date", "Open": "open", "High": "high",
                              "Low": "low", "Close": "close",
                              "Adj Close": "adj_close", "Volume": "volume"})

In [81]:
sp_df.head()

,date,open,high,low,close,adj_close,volume
0,2007-01-03,1418.030029,1429.420044,1407.859985,1416.599976,1416.599976,3429160000
1,2007-01-04,1416.599976,1421.839966,1408.430054,1418.339966,1418.339966,3004460000
2,2007-01-05,1418.339966,1418.339966,1405.750000,1409.709961,1409.709961,2919400000
3,2007-01-08,1409.260010,1414.979980,1403.969971,1412.839966,1412.839966,2763340000
4,2007-01-09,1412.839966,1415.609985,1405.420044,1412.109985,1412.109985,3038380000

In [82]:
#Export data to sqlite
sp_df.to_sql('sp_data', con=engine, if_exists = 'append', index = False)

In [85]:
engine.execute("SELECT * FROM sp_data LIMIT 15").fetchall()

[(1, '2007-01-03', 1418.030029, 1429.420044, 1407.859985, 1416.599976, 1416.599976, 3429160000),
 (2, '2007-01-04', 1416.599976, 1421.839966, 1408.430054, 1418.339966, 1418.339966, 3004460000),
 (3, '2007-01-05', 1418.339966, 1418.339966, 1405.75, 1409.709961, 1409.709961, 2919400000),
 (4, '2007-01-08', 1409.26001, 1414.97998, 1403.969971, 1412.839966, 1412.839966, 2763340000),
 (5, '2007-01-09', 1412.839966, 1415.609985, 1405.420044, 1412.109985, 1412.109985, 3038380000),
 (6, '2007-01-10', 1408.699951, 1415.98999, 1405.319946, 1414.849976, 1414.849976, 2764660000),
 (7, '2007-01-11', 1414.839966, 1427.119995, 1414.839966, 1423.819946, 1423.819946, 2857870000),
 (8, '2007-01-12', 1423.819946, 1431.22998, 1422.579956, 1430.72998, 1430.72998, 2686480000),
 (9, '2007-01-16', 1430.72998, 1433.930054, 1428.619995, 1431.900024, 1431.900024, 2599530000),
 (10, '2007-01-17', 1431.77002, 1435.27002, 1428.569946, 1430.619995, 1430.619995, 2690270000),
 (11, '2007-01-18', 1430.589966, 1432.959961, 1424.209961, 1426.369995, 1426.369995, 2822430000),
 (12, '2007-01-19', 1426.349976, 1431.569946, 1425.189941, 1430.5, 1430.5, 2777480000),
 (13, '2007-01-22', 1430.469971, 1431.390015, 1420.400024, 1422.949951, 1422.949951, 2540120000),
 (14, '2007-01-23', 1422.949951, 1431.329956, 1421.660034, 1427.98999, 1427.98999, 2975070000),
 (15, '2007-01-24', 1427.959961, 1440.140015, 1427.959961, 1440.130005, 1440.130005, 2783180000)]

In [91]:
pd.read_sql("SELECT * FROM sp_data LIMIT 15", con = conn).reset_index(drop = True)

,id,date,open,high,low,close,adj_close,volume
0,1,2007-01-03,1418.030029,1429.420044,1407.859985,1416.599976,1416.599976,3429160000
1,2,2007-01-04,1416.599976,1421.839966,1408.430054,1418.339966,1418.339966,3004460000
2,3,2007-01-05,1418.339966,1418.339966,1405.750000,1409.709961,1409.709961,2919400000
3,4,2007-01-08,1409.260010,1414.979980,1403.969971,1412.839966,1412.839966,2763340000
4,5,2007-01-09,1412.839966,1415.609985,1405.420044,1412.109985,1412.109985,3038380000
5,6,2007-01-10,1408.699951,1415.989990,1405.319946,1414.849976,1414.849976,2764660000
6,7,2007-01-11,1414.839966,1427.119995,1414.839966,1423.819946,1423.819946,2857870000
7,8,2007-01-12,1423.819946,1431.229980,1422.579956,1430.729980,1430.729980,2686480000
8,9,2007-01-16,1430.729980,1433.930054,1428.619995,1431.900024,1431.900024,2599530000
9,10,2007-01-17,1431.770020,1435.270020,1428.569946,1430.619995,1430.619995,2690270000
10,11,2007-01-18,1430.589966,1432.959961,1424.209961,1426.369995,1426.369995,2822430000
11,12,2007-01-19,1426.349976,1431.569946,1425.189941,1430.500000,1430.500000,2777480000
12,13,2007-01-22,1430.469971,1431.390015,1420.400024,1422.949951,1422.949951,2540120000
13,14,2007-01-23,1422.949951,1431.329956,1421.660034,1427.989990,1427.989990,2975070000
14,15,2007-01-24,1427.959961,1440.140015,1427.959961,1440.130005,1440.130005,2783180000

In [94]:
session = Session(engine)

In [99]:
session.query(func.max(SP_Data.date)).all()

[(datetime.date(2019, 3, 25))]

In [100]:
session.query(func.min(SP_Data.date)).all()

[(datetime.date(2007, 1, 3))]